midterm-1-guide.org
#+SETUPFILE: setup.org
#+TITLE: Midterm 1 guide

Answers on the bottom. Also, you can *bring a notecard* (5in x 7in
max) with notes or whatnot.

* Turing test

True or false? Turing first described a test between a monkey and a
human before describing a test between a human and a machine.

True or false? The goal of the machine is to convince the judge that
the human is a machine.

True or false? To pass the Turing test, the machine should be expected
to fool the judge (convince the judge that the machine is a human)
nearly 100% of the time; or, maybe just 70% of the time.

True or false? Dennett thinks that winning a chess championship is
just as strong a test for computer intelligence as the Turing test.

* Search

** General search

Give an initial state, describe possible actions and the transition
model (i.e., how states connect), and specify a goal criterion for the
following search problem:

#+BEGIN_QUOTE
A robot wants a path to exit a maze. The maze is represented as a
square grid; open areas are represented by white grid cells, and walls
are represented by black grid cells.
#+END_QUOTE

Repeat this exercise for the following search problem:

#+BEGIN_QUOTE
Recall from calculus that the derivative is the inverse of the
integral. Finding the derivative of a formula is easy (no search
needed). But finding the integral of a formula is often challenging,
and may require a search procedure. Describe this search procedure.
#+END_QUOTE

Complete the following table for weighted, finite search graphs:

| Search algorithm     | Always complete? | Always optimal? | Uses a heuristic? |
|----------------------+------------------+-----------------+-------------------|
| Random search        |                  |                 |                   |
| Breadth-first search | Yes              |                 |                   |
| Depth-first search   |                  | No              |                   |
| Hill-climbing search |                  |                 |                   |
| Best-first search    |                  |                 |                   |
| A* search            |                  |                 | Yes               |

Recall the Goodale route search problem from [[./search-practice.html][Practice with searching]]
notes. Answer the following questions for each of breadth-first
search, depth-first search, best-first search (using distances),
hill-climbing search, and A* search (using some heuristic like
distance "as the crow flies"). Assume we start at ~Woodruff & Tuttle~
and the goal is ~Goodale parking lot~. For each question, there may be
more than one correct answer.

  1. What are the first two states (beyond ~Woodruff & Tuttle~) that
     will be checked?

  2. What does the ~tocheck~ list look like after checking those
     states from question 1? Be sure to order the list by an
     appropriate sort order (breadth-first, hill-climbing, best-first,
     and A* will take the next state from the front of the list;
     depth-first will take the next state from the end).

True or false? Iterative deepening depth-first search is complete
whenever regular depth-first search is complete for some search
problem.

True or false? Iterative deepening depth-first search can usually be
expected to find a shorter path to the goal than regular depth-first
search.

What is the singular requirement for a heuristic to be called
"admissible?"

** Adversarial search

Describe a utility function for an adversarial search procedure (e.g.,
minimax) for playing chess.

True or false? Minimax is an appropriate search procedure for
single-player games (like a solitaire card game or a Rubik's cube)?

True or false? Alpha-beta pruning, as applied to the minimax
procedure, produces more optimal solutions (e.g., produces game moves
that allow the computer to win in fewer moves).

True or false? Alpha-beta pruning (applied to minimax) uses different
utility functions than regular minimax.

True or false? Alpha-beta pruning (applied to minimax) is the same
algorithm as minimax, just faster because irrelevant computations are
omitted.

* Knowledge representation

** Boolean logic

Simplify the following expression using Boole's and De Morgan's laws:
$$\neg(\neg x \vee \neg y) \wedge (x \wedge (y \vee \neg y))$$

** Propositional logic

Build a truth-table for:
$$\neg A \vee (B \leftrightarrow A)$$

Find a satisfying assignment (if any exists) for:
$$\neg A \wedge (A \rightarrow (B \wedge C))$$

Given,

  1. $(S \vee T) \wedge (A \vee B)$

  2. $S \rightarrow Q$

  3. $\neg Q$

  4. $\neg C \vee Q$

Prove (and state the rules and premises you utilize):

  1. $\neg S$

  2. $T$

  3. $\neg C \vee W$

** First-order logic

Rewrite the following statements in first-order logic:

  1. Tony is a tiger.

  2. All tigers have stripes.

  3. Some tigers are white.

  4. If any tiger is white, then we know it lives in the snow (but not
     necessarily vice versa).

  5. A tiger is not both white and orange.

Rewrite the following without using $\forall$ (hint: use negation):
$$(\forall x)(P(x) \leftrightarrow (A(x) \wedge B(x)))$$

Rewrite the following without using $\exists$:
$$(\exists x)(W(x) \vee \neg Q(x))$$

** Prolog

Given,

#+BEGIN_SRC prolog
member(X, [X|_]).
member(X, [_|Tail]) :- member(X, Tail).

foobar(X, List) :- member(Y, List), X \= Y.
#+END_SRC

What are the values of each of these queries? (Write "true" or
"false", or give one value of the variable X.)

#+BEGIN_SRC prolog
member(5, [1, 2, 3]).
member(X, [1, 2, 3]).
foobar(1, [1, 2, 3]).
foobar(1, [1, 1, 1]).
#+END_SRC

Given,

#+BEGIN_SRC prolog
family(10392,
       person(tom, fox, born(7, may, 1960), works(cnn, 152000)),
       person(ann, fox, born(19, april, 1961), works(nyu, 65000)),
       % here are the children...
       [person(pat, fox, born(5, october, 1983), unemployed),
        person(jim, fox, born(1, june, 1986), unemployed),
        person(amy, fox, born(17, december, 1990), unemployed)]).

exists(Person) :- family(_, Person, _, _).
exists(Person) :- family(_, _, Person, _).
exists(Person) :- family(_, _, _, Children), member(Person, Children).
#+END_SRC

What are the values of each of these queries (write "true" or "false",
or give one value for each of the variables)?

#+BEGIN_SRC prolog
family(_, person(_, _, born(_, _, Year), _), _, _), Year > 1960.

% don't forget to give one value for each variable:
% FirstName, LastName, and X
exists(person(FirstName, LastName, _, X)), X \= unemployed.
#+END_SRC

Do the following unify, and if so, what are values for the variables
(one set of values for each question), if any variables are involved,
that make the unification work?

  - ~foo~ and ~foo~

  - ~foo(X)~ and ~X~

  - ~foo(foo(foo))~ and ~foo(X)~

  - ~foo(X, foo)~ and ~foo(foo, X)~

  - ~foo(X, foo)~ and ~foo(Y)~

  - ~foo(foo(X, Y))~ and ~foo(Z)~

Suppose we have the following knowledge base:

#+BEGIN_SRC prolog
f(a).
f(b). 

g(a, a).
g(b, c).

h(b).
h(c).

k(X, Y) :- f(X), g(X, Y), h(Y).
#+END_SRC

Draw the resolution tree for the first successful proof of ~k(X, c)~.

* Answers...

