midterm-1-guide.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Midterm 1 guide</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Midterm 1 guide"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-07 14:07:18 EST"/>
<meta name="author" content="Joshua Eckroth"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>

<div id="preamble">
<a href="index.html">Home</a> &nbsp; &nbsp;
          <!-- Plupper Button -->
          <div id="plupperButton" style="display: inline;"></div>
          <!-- End of Plupper Button Code -->

</div>

<div id="content">
<h1 class="title">Midterm 1 guide</h1>

<p>Answers on the bottom. Also, you can <b>bring a notecard</b> (5in x 7in
max) with notes or whatnot.
</p>

<div id="table-of-contents">
<h2>TOC</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Turing test</a></li>
<li><a href="#sec-2">Search</a>
<ul>
<li><a href="#sec-2-1">General search</a></li>
<li><a href="#sec-2-2">Adversarial search</a></li>
</ul>
</li>
<li><a href="#sec-3">Knowledge representation</a>
<ul>
<li><a href="#sec-3-1">Boolean logic</a></li>
<li><a href="#sec-3-2">Propositional logic</a></li>
<li><a href="#sec-3-3">First-order logic</a></li>
<li><a href="#sec-3-4">Prolog</a></li>
</ul>
</li>
<li><a href="#sec-4">Answers&hellip;</a>
<ul>
<li><a href="#sec-4-1">Turing test</a></li>
<li><a href="#sec-4-2">Search</a>
<ul>
<li><a href="#sec-4-2-1">General search</a></li>
<li><a href="#sec-4-2-2">Adversarial search</a></li>
</ul>
</li>
<li><a href="#sec-4-3">Knowledge representation</a>
<ul>
<li><a href="#sec-4-3-1">Boolean logic</a></li>
<li><a href="#sec-4-3-2">Propositional logic</a></li>
<li><a href="#sec-4-3-3">First-order logic</a></li>
<li><a href="#sec-4-3-4">Prolog</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Turing test</h2>
<div class="outline-text-2" id="text-1">


<p>
True or false? Turing first described a test between a monkey and a
human before describing a test between a human and a machine.
</p>
<p>
True or false? The goal of the machine is to convince the judge that
the human is a machine.
</p>
<p>
True or false? To pass the Turing test, the machine should be expected
to fool the judge (convince the judge that the machine is a human)
nearly 100% of the time; or, maybe just 70% of the time.
</p>
<p>
True or false? Dennett thinks that winning a chess championship is
just as strong a test for computer intelligence as the Turing test.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Search</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">General search</h3>
<div class="outline-text-3" id="text-2-1">


<p>
Give an initial state, describe possible actions and the transition
model (i.e., how states connect), and specify a goal criterion for the
following search problem:
</p>
<blockquote>

<p>A robot wants a path to exit a maze. The maze is represented as a
square grid; open areas are represented by white grid cells, and walls
are represented by black grid cells.
</p>
</blockquote>


<p>
Repeat this exercise for the following search problem:
</p>
<blockquote>

<p>Recall from calculus that the derivative is the inverse of the
integral. Finding the derivative of a formula is easy (no search
needed). But finding the integral of a formula is often challenging,
and may require a search procedure. Describe this search procedure.
</p>
</blockquote>


<p>
Complete the following table for weighted, finite search graphs:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Search algorithm</th><th scope="col" class="left">Always complete?</th><th scope="col" class="left">Always optimal?</th><th scope="col" class="left">Uses a heuristic?</th></tr>
</thead>
<tbody>
<tr><td class="left">Random search</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">Breadth-first search</td><td class="left">Yes</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">Depth-first search</td><td class="left"></td><td class="left">No</td><td class="left"></td></tr>
<tr><td class="left">Hill-climbing search</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">Best-first search</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">A* search</td><td class="left"></td><td class="left"></td><td class="left">Yes</td></tr>
</tbody>
</table>


<p>
Recall the Goodale route search problem from <a href="./search-practice.html">Practice with searching</a>
notes. Answer the following questions for each of breadth-first
search, depth-first search, best-first search (using distances),
hill-climbing search, and A* search (using some heuristic like
distance &ldquo;as the crow flies&rdquo;). Assume we start at <code>Woodruff &amp; Tuttle</code>
and the goal is <code>Goodale parking lot</code>. For each question, there may be
more than one correct answer.
</p>
<ol>
<li>What are the first two states (beyond <code>Woodruff &amp; Tuttle</code>) that
     will be checked?

</li>
<li>What does the <code>tocheck</code> list look like after checking those
     states from question 1? Be sure to order the list by an
     appropriate sort order (breadth-first, hill-climbing, best-first,
     and A* will take the next state from the front of the list;
     depth-first will take the next state from the end).
</li>
</ol>


<p>
True or false? Iterative deepening depth-first search is complete
whenever regular depth-first search is complete for some search
problem.
</p>
<p>
True or false? Iterative deepening depth-first search can usually be
expected to find a shorter path to the goal than regular depth-first
search.
</p>
<p>
What is the singular requirement for a heuristic to be called
&ldquo;admissible?&rdquo;
</p>
</div>

</div>
