midterm-1-guide.org
*** General search

Give an initial state, describe possible actions and the transition
model (i.e., how states connect), and specify a goal criterion for the
following search problem:

#+BEGIN_QUOTE
A robot wants a path to exit a maze. The maze is represented as a
square grid; open areas are represented by white grid cells, and walls
are represented by black grid cells.
#+END_QUOTE

  - initial state: the robot's starting location

  - possible actions: move north, south, east, west (not all movements
    are always possible)

  - transition model: look at the map, connect grid locations via
    north/south/east/west links

  - goal criterion: finding the exit from the maze

Repeat this exercise for the following search problem:

#+BEGIN_QUOTE
Recall from calculus that the derivative is the inverse of the
integral. Finding the derivative of a formula is easy (no search
needed). But finding the integral of a formula is often challenging,
and may require a search procedure. Describe this search procedure.
#+END_QUOTE

  - initial state: the starting formula that needs a symbolic integral
    to be found

  - possible actions / transition model: create a database like this:

    - ~sin(x) --> -cos(x)~

    - ~cx --> cx^2/2~

    - ~x^n --> (x^(n+1)/(n+1))~

    - ...

  - goal criterion: say you are looking at a new formula ~g~, and the
    original formula is ~f~, then you want ~dg/dx = f~; every "state"
    (formula) is checked in this way

Complete the following table for weighted, finite search graphs:

| Search algorithm     | Always complete? | Always optimal? | Uses a heuristic? |
|----------------------+------------------+-----------------+-------------------|
| Random search        | Yes              | No              | No                |
| Breadth-first search | Yes              | No              | No                |
| Depth-first search   | Yes              | No              | No                |
| Hill-climbing search | No               | No              | Yes               |
| Best-first search    | Yes              | No              | Yes               |
| A* search            | Yes              | Yes             | Yes               |

Recall the Goodale route search problem from [[./search-practice.html][Practice with searching]]
notes. Answer the following questions for each of breadth-first
search, depth-first search, best-first search (using distances),
hill-climbing search, and A* search (using some heuristic like
distance "as the crow flies"). Assume we start at ~Woodruff & Tuttle~
and the goal is ~Goodale parking lot~. For each question, there may be
more than one correct answer.

  1. What are the first two states (beyond ~Woodruff & Tuttle~) that
     will be checked?

     - breadth-first (one possible answer): ~Lane & Tuttle~, ~High &
       Woodruff~

     - depth-first (one possible answer): ~Lane & Tuttle~, ~SR-315 &
       Lane~

     - best-first (only answer): ~High & Woodruff~, ~High & 15th~

     - hill-climbing (only answer): same as best-first

     - A* (only answer): ~Lane & Tuttle~, ~High & Woodruff~

  2. What does the ~tocheck~ list look like after checking those
     states from question 1? Be sure to order the list by an
     appropriate sort order (breadth-first, hill-climbing, best-first,
     and A* will take the next state from the front of the list;
     depth-first will take the next state from the end). Assume
     already-checked states are not added.

     - breadth-first (one possible answer): ~[SR-315 & Lane, High & 15th]~

     - depth-first (one possible answer): ~[High & Woodruff, SR-315 I-670 offramp, SR-315 & King]~

     - best-first: ~[High & 11th, US-23 & 15th, Lane & Tuttle]~

     - hill-climbing: ~[High & 11th, US-23 & 15th]~

     - A*: ~[High & 15th, SR-315 & Lane]~

True or false? Iterative deepening depth-first (IDDFS) search is
complete whenever regular depth-first search is complete for some
search problem.

*True* --- DFS is complete when the search space is not
infinite. Since IDDFS performs repeated DFS (with greater depth
limits), it too will be complete if DFS is.

True or false? Iterative deepening depth-first search can usually be
expected to find a shorter path to the goal than regular depth-first
search.

*True* --- The purpose of IDDFS is to not get lost in deep searches by
putting a limit on the DFS depth (which causes more breadth to be
searched because it hits the depth limit).

What is the singular requirement for a heuristic to be called
"admissible?"

  - The heuristic must always /underestimate/ (or exactly match) the
    true cost from the current state to the goal state.

*** Adversarial search

Describe a utility function for an adversarial search procedure (e.g.,
minimax) for playing chess.

  - One possible answer: Number of captured pieces, maybe with a
    weight for each piece (so a queen will have a large weight, a pawn
    not so much)

True or false? Minimax is an appropriate search procedure for
single-player games (like a solitaire card game or a Rubik's cube)?

*False* --- there is no adversary to simulate and minimize, thus no
minimax

True or false? Alpha-beta pruning, as applied to the minimax
procedure, produces more optimal solutions (e.g., produces game moves
that allow the computer to win in fewer moves).

*False* --- alpha-beta does not change the solutions.

True or false? Alpha-beta pruning (applied to minimax) uses different
utility functions than regular minimax.

*False* --- the utility functions are not changed, just which parts of
the search space are actually searched.

True or false? Alpha-beta pruning (applied to minimax) is the same
algorithm as minimax, just faster because irrelevant computations are
omitted.

*True* --- that's all alpha-beta pruning is; it still does minimax.

** Knowledge representation

*** Boolean logic

Simplify the following expression using Boole's and De Morgan's laws:
$$\neg(\neg x \vee \neg y) \wedge (x \wedge (y \vee \neg y))$$

  - Change $y \vee \neg y$ to $T$, yielding: $\neg(\neg x \vee \neg y)
    \wedge (x \wedge T)$

  - Change $x \wedge T$ to $x$, yielding: $\neg(\neg x \vee \neg y)
    \wedge x$

  - Distribute the negative, yielding: $(x \wedge y) \wedge x$

  - Get rid of parentheses, reduce redundancy, yielding $x \wedge y$

