midterm-1-guide.html

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">Search</h3>
<div class="outline-text-3" id="text-4-2">



</div>

<div id="outline-container-4-2-1" class="outline-4">
<h4 id="sec-4-2-1">General search</h4>
<div class="outline-text-4" id="text-4-2-1">


<p>
Give an initial state, describe possible actions and the transition
model (i.e., how states connect), and specify a goal criterion for the
following search problem:
</p>
<blockquote>

<p>A robot wants a path to exit a maze. The maze is represented as a
square grid; open areas are represented by white grid cells, and walls
are represented by black grid cells.
</p>
</blockquote>


<ul>
<li>initial state: the robot&rsquo;s starting location

</li>
<li>possible actions: move north, south, east, west (not all movements
    are always possible)

</li>
<li>transition model: look at the map, connect grid locations via
    north/south/east/west links

</li>
<li>goal criterion: finding the exit from the maze
</li>
</ul>


<p>
Repeat this exercise for the following search problem:
</p>
<blockquote>

<p>Recall from calculus that the derivative is the inverse of the
integral. Finding the derivative of a formula is easy (no search
needed). But finding the integral of a formula is often challenging,
and may require a search procedure. Describe this search procedure.
</p>
</blockquote>


<ul>
<li>initial state: the starting formula that needs a symbolic integral
    to be found

</li>
<li>possible actions / transition model: create a database like this:

<ul>
<li><code>sin(x) --&gt; -cos(x)</code>

</li>
<li><code>cx --&gt; cx^2/2</code>

</li>
<li><code>x^n --&gt; (x^(n+1)/(n+1))</code>

</li>
<li>&hellip;

</li>
</ul>

</li>
<li>goal criterion: say you are looking at a new formula <code>g</code>, and the
    original formula is <code>f</code>, then you want <code>dg/dx = f</code>; every &ldquo;state&rdquo;
    (formula) is checked in this way
</li>
</ul>


<p>
Complete the following table for weighted, finite search graphs:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Search algorithm</th><th scope="col" class="left">Always complete?</th><th scope="col" class="left">Always optimal?</th><th scope="col" class="left">Uses a heuristic?</th></tr>
</thead>
<tbody>
<tr><td class="left">Random search</td><td class="left">Yes</td><td class="left">No</td><td class="left">No</td></tr>
<tr><td class="left">Breadth-first search</td><td class="left">Yes</td><td class="left">No</td><td class="left">No</td></tr>
<tr><td class="left">Depth-first search</td><td class="left">Yes</td><td class="left">No</td><td class="left">No</td></tr>
<tr><td class="left">Hill-climbing search</td><td class="left">No</td><td class="left">No</td><td class="left">Yes</td></tr>
<tr><td class="left">Best-first search</td><td class="left">Yes</td><td class="left">No</td><td class="left">Yes</td></tr>
<tr><td class="left">A* search</td><td class="left">Yes</td><td class="left">Yes</td><td class="left">Yes</td></tr>
</tbody>
</table>


<p>
Recall the Goodale route search problem from <a href="./search-practice.html">Practice with searching</a>
notes. Answer the following questions for each of breadth-first
search, depth-first search, best-first search (using distances),
hill-climbing search, and A* search (using some heuristic like
distance &ldquo;as the crow flies&rdquo;). Assume we start at <code>Woodruff &amp; Tuttle</code>
and the goal is <code>Goodale parking lot</code>. For each question, there may be
more than one correct answer.
</p>
<ol>
<li>What are the first two states (beyond <code>Woodruff &amp; Tuttle</code>) that
     will be checked?

<ul>
<li>breadth-first (one possible answer): <code>Lane &amp; Tuttle</code>, <code>High &amp;        Woodruff</code>

</li>
<li>depth-first (one possible answer): <code>Lane &amp; Tuttle</code>, <code>SR-315 &amp;        Lane</code>

</li>
<li>best-first (only answer): <code>High &amp; Woodruff</code>, <code>High &amp; 15th</code>

</li>
<li>hill-climbing (only answer): same as best-first

</li>
<li>A* (only answer): <code>Lane &amp; Tuttle</code>, <code>High &amp; Woodruff</code>

</li>
</ul>

</li>
<li>What does the <code>tocheck</code> list look like after checking those
     states from question 1? Be sure to order the list by an
     appropriate sort order (breadth-first, hill-climbing, best-first,
     and A* will take the next state from the front of the list;
     depth-first will take the next state from the end). Assume
     already-checked states are not added.

<ul>
<li>breadth-first (one possible answer): <code>[SR-315 &amp; Lane, High &amp; 15th]</code>

</li>
<li>depth-first (one possible answer): <code>[High &amp; Woodruff, SR-315 I-670 offramp, SR-315 &amp; King]</code>

</li>
<li>best-first: <code>[High &amp; 11th, US-23 &amp; 15th, Lane &amp; Tuttle]</code>

</li>
<li>hill-climbing: <code>[High &amp; 11th, US-23 &amp; 15th]</code>

</li>
<li>A*: <code>[High &amp; 15th, SR-315 &amp; Lane]</code>
</li>
</ul>

</li>
</ol>


<p>
True or false? Iterative deepening depth-first (IDDFS) search is
complete whenever regular depth-first search is complete for some
search problem.
</p>
<p>
<b>True</b> &mdash; DFS is complete when the search space is not
infinite. Since IDDFS performs repeated DFS (with greater depth
limits), it too will be complete if DFS is.
</p>
<p>
True or false? Iterative deepening depth-first search can usually be
expected to find a shorter path to the goal than regular depth-first
search.
</p>
<p>
<b>True</b> &mdash; The purpose of IDDFS is to not get lost in deep searches by
putting a limit on the DFS depth (which causes more breadth to be
searched because it hits the depth limit).
</p>
<p>
What is the singular requirement for a heuristic to be called
&ldquo;admissible?&rdquo;
</p>
<ul>
<li>The heuristic must always <i>underestimate</i> (or exactly match) the
    true cost from the current state to the goal state.
</li>
</ul>


</div>

</div>

<div id="outline-container-4-2-2" class="outline-4">
<h4 id="sec-4-2-2">Adversarial search</h4>
<div class="outline-text-4" id="text-4-2-2">


<p>
Describe a utility function for an adversarial search procedure (e.g.,
minimax) for playing chess.
</p>
<ul>
<li>One possible answer: Number of captured pieces, maybe with a
    weight for each piece (so a queen will have a large weight, a pawn
    not so much)
</li>
</ul>


<p>
True or false? Minimax is an appropriate search procedure for
single-player games (like a solitaire card game or a Rubik&rsquo;s cube)?
</p>
<p>
<b>False</b> &mdash; there is no adversary to simulate and minimize, thus no
minimax
</p>
<p>
True or false? Alpha-beta pruning, as applied to the minimax
procedure, produces more optimal solutions (e.g., produces game moves
that allow the computer to win in fewer moves).
</p>
<p>
<b>False</b> &mdash; alpha-beta does not change the solutions.
</p>
<p>
True or false? Alpha-beta pruning (applied to minimax) uses different
utility functions than regular minimax.
</p>
<p>
<b>False</b> &mdash; the utility functions are not changed, just which parts of
the search space are actually searched.
</p>
<p>
True or false? Alpha-beta pruning (applied to minimax) is the same
algorithm as minimax, just faster because irrelevant computations are
omitted.
</p>
<p>
<b>True</b> &mdash; that&rsquo;s all alpha-beta pruning is; it still does minimax.
</p>
</div>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3">Knowledge representation</h3>
<div class="outline-text-3" id="text-4-3">



</div>

<div id="outline-container-4-3-1" class="outline-4">
<h4 id="sec-4-3-1">Boolean logic</h4>
<div class="outline-text-4" id="text-4-3-1">


<p>
Simplify the following expression using Boole&rsquo;s and De Morgan&rsquo;s laws:
$$\neg(\neg x \vee \neg y) \wedge (x \wedge (y \vee \neg y))$$

</p><ul>
<li>Change \(y \vee \neg y\) to \(T\), yielding: \(\neg(\neg x \vee \neg y)
    \wedge (x \wedge T)\)

</li>
<li>Change \(x \wedge T\) to \(x\), yielding: \(\neg(\neg x \vee \neg y)
    \wedge x\)

</li>
<li>Distribute the negative, yielding: \((x \wedge y) \wedge x\)

</li>
<li>Get rid of parentheses, reduce redundancy, yielding \(x \wedge y\)
</li>
</ul>


</div>

</div>
