midterm-1-guide.org
*** Propositional logic

Build a truth-table for:
$$\neg A \vee (B \leftrightarrow A)$$

| $A$ | $B$ | $B \leftrightarrow A$ | $\neg A \vee (B \leftrightarrow A)$ |
|-----+-----+-----------------------+-------------------------------------|
| T   | T   | T                     | T                                   |
| T   | F   | F                     | F                                   |
| F   | T   | F                     | T                                   |
| F   | F   | T                     | T                                   |

Find a satisfying assignment (if any exists) for:
$$\neg A \wedge (A \rightarrow (B \wedge C))$$

Build a truth table to find this:

| $A$ | $B$ | $C$ | $B \wedge C$ | $A \rightarrow (B \wedge C)$ | $\neg A \wedge (A \rightarrow (B \wedge C))$ |
|-----+-----+-----+--------------+------------------------------+----------------------------------------------|
| T   | T   | T   | T            | T                            | F                                            |
| T   | T   | F   | F            | F                            | F                                            |
| T   | F   | T   | F            | F                            | F                                            |
| T   | F   | F   | F            | F                            | F                                            |
| F   | T   | T   | T            | T                            | T                                            |
| F   | T   | F   | F            | T                            | T                                            |
| F   | F   | T   | F            | T                            | T                                            |
| F   | F   | F   | F            | T                            | T                                            | 

The last four rows will provide satisfying assignments.  

Given,

  1. $(S \vee T) \wedge (A \vee B)$

  2. $S \rightarrow Q$

  3. $\neg Q$

  4. $\neg C \vee Q$

Prove (and state the rules and premises you utilize):

  1. $\neg S$

     1. From 2, 3 and modus tollens.

  2. $T$

     1. From $\neg S$ (above) and 1, simplification, and disjunctive
        syllogism.

  3. $\neg C \vee W$

     1. From 3, 4 and disjunctive syllogism (which gives us $\neg C$);
        now apply addition plus introduce the arbitrary symbol $W$
        (which is allowed with the addition rule)

*** First-order logic

Rewrite the following statements in first-order logic:

  1. Tony is a tiger.

     - $Tiger(Tony)$

  2. All tigers have stripes.

     - $(\forall x)(Tiger(x) \rightarrow Striped(x))$

  3. Some tigers are white.

     - $(\exists x)(Tiger(x) \wedge White(x))$

  4. If any tiger is white, then we know it lives in the snow (but not
     necessarily vice versa).

     - $(\forall x)((Tiger(x) \wedge White(x)) \rightarrow LivesInSnow(x))$

  5. A tiger is not both white and orange.

     - $(\forall x)(Tiger(x) \rightarrow (\neg White(x) \vee \neg Orange(x)))$

Rewrite the following without using $\forall$ (hint: use negation):
$$(\forall x)(P(x) \leftrightarrow (A(x) \wedge B(x)))$$

$$\neg(\exists x)((P(x) \vee (A(x) \wedge B(x))) \wedge (\neg P(x)
\vee \neg(A(x) \wedge B(x))))$$

Rewrite the following without using $\exists$:
$$(\exists x)(W(x) \vee \neg Q(x))$$

$$\neg (\forall x)(\neg W(x) \wedge Q(x))$$

