midterm-1-guide.html

<div id="outline-container-4-3-2" class="outline-4">
<h4 id="sec-4-3-2">Propositional logic</h4>
<div class="outline-text-4" id="text-4-3-2">


<p>
Build a truth-table for:
$$\neg A \vee (B \leftrightarrow A)$$

</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">\(A\)</th><th scope="col" class="left">\(B\)</th><th scope="col" class="left">\(B \leftrightarrow A\)</th><th scope="col" class="left">\(\neg A \vee (B \leftrightarrow A)\)</th></tr>
</thead>
<tbody>
<tr><td class="left">T</td><td class="left">T</td><td class="left">T</td><td class="left">T</td></tr>
<tr><td class="left">T</td><td class="left">F</td><td class="left">F</td><td class="left">F</td></tr>
<tr><td class="left">F</td><td class="left">T</td><td class="left">F</td><td class="left">T</td></tr>
<tr><td class="left">F</td><td class="left">F</td><td class="left">T</td><td class="left">T</td></tr>
</tbody>
</table>


<p>
Find a satisfying assignment (if any exists) for:
$$\neg A \wedge (A \rightarrow (B \wedge C))$$

Build a truth table to find this:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">\(A\)</th><th scope="col" class="left">\(B\)</th><th scope="col" class="left">\(C\)</th><th scope="col" class="left">\(B \wedge C\)</th><th scope="col" class="left">\(A \rightarrow (B \wedge C)\)</th><th scope="col" class="left">\(\neg A \wedge (A \rightarrow (B \wedge C))\)</th></tr>
</thead>
<tbody>
<tr><td class="left">T</td><td class="left">T</td><td class="left">T</td><td class="left">T</td><td class="left">T</td><td class="left">F</td></tr>
<tr><td class="left">T</td><td class="left">T</td><td class="left">F</td><td class="left">F</td><td class="left">F</td><td class="left">F</td></tr>
<tr><td class="left">T</td><td class="left">F</td><td class="left">T</td><td class="left">F</td><td class="left">F</td><td class="left">F</td></tr>
<tr><td class="left">T</td><td class="left">F</td><td class="left">F</td><td class="left">F</td><td class="left">F</td><td class="left">F</td></tr>
<tr><td class="left">F</td><td class="left">T</td><td class="left">T</td><td class="left">T</td><td class="left">T</td><td class="left">T</td></tr>
<tr><td class="left">F</td><td class="left">T</td><td class="left">F</td><td class="left">F</td><td class="left">T</td><td class="left">T</td></tr>
<tr><td class="left">F</td><td class="left">F</td><td class="left">T</td><td class="left">F</td><td class="left">T</td><td class="left">T</td></tr>
<tr><td class="left">F</td><td class="left">F</td><td class="left">F</td><td class="left">F</td><td class="left">T</td><td class="left">T</td></tr>
</tbody>
</table>


<p>
The last four rows will provide satisfying assignments.  
</p>
<p>
Given,
</p>
<ol>
<li>\((S \vee T) \wedge (A \vee B)\)

</li>
<li>\(S \rightarrow Q\)

</li>
<li>\(\neg Q\)

</li>
<li>\(\neg C \vee Q\)
</li>
</ol>


<p>
Prove (and state the rules and premises you utilize):
</p>
<ol>
<li>\(\neg S\)

<ol>
<li>From 2, 3 and modus tollens.

</li>
</ol>

</li>
<li>\(T\)

<ol>
<li>From \(\neg S\) (above) and 1, simplification, and disjunctive
        syllogism.

</li>
</ol>

</li>
<li>\(\neg C \vee W\)

<ol>
<li>From 3, 4 and disjunctive syllogism (which gives us \(\neg C\));
        now apply addition plus introduce the arbitrary symbol \(W\)
        (which is allowed with the addition rule)
</li>
</ol>

</li>
</ol>


</div>

</div>

<div id="outline-container-4-3-3" class="outline-4">
<h4 id="sec-4-3-3">First-order logic</h4>
<div class="outline-text-4" id="text-4-3-3">


<p>
Rewrite the following statements in first-order logic:
</p>
<ol>
<li>Tony is a tiger.

<ul>
<li>\(Tiger(Tony)\)

</li>
</ul>

</li>
<li>All tigers have stripes.

<ul>
<li>\((\forall x)(Tiger(x) \rightarrow Striped(x))\)

</li>
</ul>

</li>
<li>Some tigers are white.

<ul>
<li>\((\exists x)(Tiger(x) \wedge White(x))\)

</li>
</ul>

</li>
<li>If any tiger is white, then we know it lives in the snow (but not
     necessarily vice versa).

<ul>
<li>\((\forall x)((Tiger(x) \wedge White(x)) \rightarrow LivesInSnow(x))\)

</li>
</ul>

</li>
<li>A tiger is not both white and orange.

<ul>
<li>\((\forall x)(Tiger(x) \rightarrow (\neg White(x) \vee \neg Orange(x)))\)
</li>
</ul>

</li>
</ol>


<p>
Rewrite the following without using \(\forall\) (hint: use negation):
$$(\forall x)(P(x) \leftrightarrow (A(x) \wedge B(x)))$$

$$\neg(\exists x)((P(x) \vee (A(x) \wedge B(x))) \wedge (\neg P(x)
\vee \neg(A(x) \wedge B(x))))$$

Rewrite the following without using \(\exists\):
$$(\exists x)(W(x) \vee \neg Q(x))$$

$$\neg (\forall x)(\neg W(x) \wedge Q(x))$$

</p></div>

</div>
